dictionary = {
    '1': 22,
    '2': 14,
    '3': 23,
    '4': 19,
    '5': 22,
    '6': 16,
    '7': 14,
    '8': 10,
    '9': 11,
    '10': 9,
    '11': 12,
    '12': 14,
    '13': 16,
    '14': 17,
    '15': 16,
    '16': 21,
    '17': 10,
    '18': 17,
    '19': 18,
    '20': 19,
    '21': 19,
    '22': 19,
    '23': 18,
    '24': 22,
    '25': 23,
    '26': 29,
    '27': 26,
    '28': 22,
    '29': 25,
    '30': 24,
    '31': 20

}
print('Самая высокая температура в мае: ', max(dictionary.values()), 'C.')
print('Самый теплый день был: ', max(dictionary, key = dictionary.get), 'мая.')


